#=================================================================
# 1-50 arasındaki pisagor üçlülelerini tespit edecek python 
# kodlarını yazınız.
# (1,2,3) (1,2,4) (1,2,5) ... (1,2,50)
# (1,3,3) (1,3,4) (1,3,5) ... (1,3,50)
# (1,4,3) (1,4,4) (1,4,5) ... (1,4,50)
# (1,5,3) (1,5,4) (1,5,5) ... (1,5,50)
#=================================================================

def pisagorU():
    
    for a in range(1,51):
        for b in range(1,51):
            for c in range(1,51):
                
                toplam = a*a + b*b
                if toplam == c*c:
                    print(a,b,c)
                    
